app/controllers/albums_controller.rb

  def index
    @albums = Album.all
    @photos = Photo.all.paginate(:per_page => 18, :page => params[:page])
---
SELECT "albums".* FROM "albums"
SELECT "photos".* FROM "photos" WHERE ("photos".album_id = 39)

  def show
    @album = Album.find(params[:id])
    @photos = Photo.where("album_id = #{@album.id}").paginate(:per_page => 18, :page => params[:page])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = 39 LIMIT 1
SELECT "photos".* FROM "photos" WHERE (album_id = 39)