app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
---
  def index
    @photos = Photo.all.paginate(:per_page => 18, :page => params[:page])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = 2208 LIMIT 1
SELECT "albums".* FROM "albums" WHERE "albums"."id" = 39 LIMIT 1
---
  def show
    @photo = Photo.find(params[:id])
    @album = Album.find(@photo.album_id)